Repository: openstack-archive/deb-cinder
Catalog: debian/po/*.po
Languages: es, pt

source: Set up a database for Cinder?
es: ¿Desea configurar una base de datos para Cinder?
pt: Configurar uma base de dados para o Cinder?

source: No database has been set up for Cinder to use. Before continuing, you should make sure you have the following information:
es: No se ha configurado ninguna base de datos para Cinder. Antes de continuar debe asegurarse de que dispone de los siguientes datos:
pt: Não foi definida nenhuma base de dados para uso do Cinder. Antes de continuar, deve certificar-se que tem a seguinte informação:

source: * the type of database that you want to use; * the database server hostname (that server must allow TCP connections from this machine); * a username and password to access the database.
es: * el tipo de base de datos que quiere utilizar; * el nombre del equipo del servidor de la base de datos (el servidor debe permitir conexiones TCP desde este equipo). * el nombre de usuario y la contraseña para acceder a la base de datos.
pt: * o tipo de base de dados que deseja usar; * o nome da máquina do servidor da base de dados (que tem que permitir ligações TCP a partir desta máquina); * um nome de utilizador e palavra-passe para aceder à base de dados.

source: If some of these requirements are missing, do not choose this option and run with regular SQLite support.
es: Si no dispone de alguno de estos datos, seleccione «no» en este apartado y ejecute Cinder con SQLite.
pt: Se não tem alguns destes requisitos, não escolha esta opção e corra com suporte SQLite normal.

source: You can change this setting later on by running "dpkg-reconfigure -plow cinder".
es: Podrá cambiar esta configuración más adelante ejecutando «dpkg-reconfigure -plow cinder».
pt: Pode mudar esta definição mais tarde executando "dpkg-reconfigure -plow cinder".

source: Authentication server hostname:
es: Nombre del equipo del servidor de autenticación:
pt: Nome do servidor de autenticação:

source: Please specify the hostname of the authentication server. Typically this is also the hostname of the OpenStack Identity Service (Keystone).
es: Indique el nombre del equipo del servidor de autenticación. Suele ser el nombre del equipo del Servicio de Identidad de OpenStack (Keystone).
pt: Por favor especifique o nome de máquina do servidor de autenticação. Tipicamente este é também o nome de máquina do Serviço de Identidade OpenStack (Keystone).

source: Authentication server tenant name:
es: Nombre del inquilino («tenant») del servidor de autenticación:
pt: Nome do inquilino ('tenant') do servidor de autenticação:

source: Please specify the authentication server tenant name.
es: Indique el nombre del inquilino («tenant») del servidor de autenticación.
pt: Indique por favor o nome 'tenant' do servidor de autenticação.

source: Authentication server username:
es: Nombre de usuario del servidor de autenticación:
pt: Nome de utilizador do servidor de autenticação:

source: Please specify the username to use with the authentication server.
es: Indique el nombre de usuario para usar con el servidor de autenticación.
pt: Indique por favor o nome de utilizador a usar com o servidor de autenticação.

source: Authentication server password:
es: Contraseña del servidor de autenticación:
pt: Palavra-passe do servidor de autenticação:

source: Please specify the password to use with the authentication server.
es: Indique la contraseña para usar con el servidor de autenticación.
pt: Indique por favor a palavra-passe a usar com o servidor de autenticação.

source: Cinder volume group:
es: Grupo de volúmenes para Cinder:
pt: Grupo de volume do Cinder:

source: Please specify the name of the LVM volume group on which Cinder will create partitions.
es: Indique el nombre del grupo de volúmenes LVM en el que Cinder creará las particiones.
pt: Indique por favor o nome do grupo de volume LVM no qual o Cinder irá criar partições.

source: IP address of your RabbitMQ host:
pt: Endereço IP da sua máquina RabbitMQ:

source: In order to interoperate with other components of OpenStack, this package needs to connect to a central RabbitMQ server.
pt: De modo a conseguir trabalhar com outros componentes do OpenStack, este pacote precisa de se ligar a um servidor central RabbitMQ.

source: Please specify the IP address of that server.
pt: Indique por favor o endereço IP desse servidor.

source: Username for connection to the RabbitMQ server:
pt: Nome de utilizador para ligação ao servidor RabbitMQ:

source: Please specify the username used to connect to the RabbitMQ server.
pt: Indique por favor o nome de utilizador para se ligar ao servidor RabbitMQ.

source: Password for connection to the RabbitMQ server:
pt: Palavra-passe para ligação ao servidor RabbitMQ:

source: Please specify the password used to connect to the RabbitMQ server.
pt: Indique por favor a palavra-passe usada para ligar ao servidor RabbitMQ.

source: Register Cinder in the Keystone endpoint catalog?
es: ¿Desea registrar Cinder en el catálogo de puntos finales de Keystone?
pt: Registar o Cinder no catálogo do ponto de ligação do Keystone?

source: Each OpenStack service (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". This can be done automatically now.
es: Debe registrar cada uno de los servicios OpenStack (cada API) para que sean accesibles. Esto se lleva a cabo mediante las órdenes «keystone service-create» y «keystone endpoint-create». Puede hacerlo ahora automáticamente.
pt: Cada serviço OpenStack (cada API) deve ser registado de modo a ser acessível. Isto é feito através do "keystone service-create" e "keystone endpoint-create". Isto pode ser feito automaticamente agora.

source: Note that you will need to have an up and running Keystone server on which to connect using the Keystone authentication token.
es: Tenga en cuenta que necesitará disponer de un servidor Keystone en ejecución al que conectarse utilizando el token de autenticación de Keystone.
pt: Note que irá precisar de ter um servidor Keystone a correr onde se ligar para se autenticar com um sinal de autenticação do Keystone.

source: Keystone server IP address:
es: Dirección IP del servidor Keystone:
pt: Endereço IP do Keystone:

source: Please enter the IP address of the Keystone server, so that cinder-api can contact Keystone to do the Cinder service and endpoint creation.
es: Introduzca la dirección IP del servidor Keystone para que cinder-api pueda contactar con Keystone para realizar el servicio Cinder y crear el punto final.
pt: Indique o endereço IP do seu servidor Keystone, de modo a que o cinder-api possa contactar o Keystone para criar o serviço Cinder e o ponto de ligação.

source: Keystone authentication token:
es: Token de autenticación de Keystone:
pt: Sinal (token) de autenticação do Keystone:

source: To configure its endpoint in Keystone, cinder-api needs the Keystone authentication token.
es: Para configurar su punto final en Keystone, cinder-api necesita el token de autenticación de Keystone.
pt: Para configurar o seu ponto de ligação no Keystone, o cinder-api precisa do sinal de autenticação do Keystone.

source: Cinder endpoint IP address:
es: Dirección IP del punto final de Cinder:
pt: Endereço IP do ponto de ligação Cinder:

source: Please enter the IP address that will be used to contact Cinder.
es: Introduzca la dirección IP que se utilizará para contactar con Cinder.
pt: Indique o endereço IP que será usado para contactar com o Cinder.

source: This IP address should be accessible from the clients that will use this service, so if you are installing a public cloud, this should be a public IP address.
es: Esta dirección IP debe ser accesible desde los clientes que usarán este servicio, por lo que si está instalando una nube pública, debería ser una dirección IP pública.
pt: Este endereço IP deverá ser acessível a partir dos clientes que usarão este serviço, portanto se está a instalar uma cloud pública, este deve ser um endereço IP público.

source: Name of the region to register:
es: Nombre de la región a registrar:
pt: Nome da região a registar:

source: OpenStack supports using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
es: OpenStack puede utilizarse con zonas de disponibilidad, donde cada región representa una ubicación. Introduzca la zona que desea utilizar cuando registre el punto final.
pt: O OpenStack pode ser usado usando zonas de disponibilidade, com cada região a representar uma localização. Por favor, indique a zona que quer usar ao registar o ponto de ligação.
